ka2_2024/src/Enums/ВариантыОбособленияПриПередачеВПереработку/ВариантыОбособленияПриПередачеВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбособленияПриПередачеВПереработку</name>
  <enumValues>
    <name>НазначениеПродукции</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПереработчику</name>
  </enumValues>
  <enumValues>
    <name>ДоговорСПереработчиком</name>
  </enumValues>
  <enumValues>
    <name>НеОбосабливать</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Constants/ФормироватьФинансовыйРезультат/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// При отключении опции, для вариантов обособления по направлению деятельности установим значения по умолчанию.
	Если Не ЭтотОбъект.Значение = Истина Тогда
		
		Если Константы.ВариантОбособленияТоваровВоВнутреннемПотреблении.Получить() =
			Перечисления.ВариантыОбособленияТоваровВоВнутреннемПотреблении.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВоВнутреннемПотреблении.Установить(Перечисления.ВариантыОбособленияТоваровВоВнутреннемПотреблении.ЗаказНаВнутреннееПотребление);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВПеремещении.Получить() =
			Перечисления.ВариантыОбособленияТоваровВПеремещении.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВПеремещении.Установить(Перечисления.ВариантыОбособленияТоваровВПеремещении.НазначениеПолучателя);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВПродажах.Получить() =
			Перечисления.ВариантыОбособленияТоваровВПродажах.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВПродажах.Установить(Перечисления.ВариантыОбособленияТоваровВПродажах.ЗаказКлиента);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВСборке.Получить() =
			Перечисления.ВариантыОбособленияТоваровВСборке.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВСборке.Установить(Перечисления.ВариантыОбособленияТоваровВСборке.НазначениеСобираемогоКомплекта);
			
		КонецЕсли;
		
		//++ НЕ УТ
		
		//++ Устарело_Переработка24
		Если Константы.ВариантОбособленияМатериаловВПереработке.Получить() =
			Перечисления.ВариантыОбособленияПриПередачеВПереработку.НаправлениеДеятельности Тогда
			Константы.ВариантОбособленияМатериаловВПереработке.Установить(
				Перечисления.ВариантыОбособленияПриПередачеВПереработку.ЗаказПереработчику);
		КонецЕсли;
		//-- Устарело_Переработка24
		
		Если Константы.ВариантОбособленияВПередачеПереработчику2_5.Получить() =
			Перечисления.ВариантыОбособленияПриПередачеВПереработку.НаправлениеДеятельности Тогда
			Константы.ВариантОбособленияВПередачеПереработчику2_5.Установить(
				Перечисления.ВариантыОбособленияПриПередачеВПереработку.ЗаказПереработчику);
		КонецЕсли;
		//-- НЕ УТ
		
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
